In [1]:
import pandas as pd

sales=pd.DataFrame({'weekday':['sun','mon','sun','mon'],
             'city':['austin','dallas','austin','dallas'],
             'bread':[139,237,326,456],
             'butter':[20,45,70,98]
             })

In [2]:
sales

  weekday    city  bread  butter
0     sun  austin    139      20
1     mon  dallas    237      45
2     sun  austin    326      70
3     mon  dallas    456      98

### create a DF from another DF

In [3]:
df1=sales[["bread","butter"]]
df1

   bread  butter
0    139      20
1    237      45
2    326      70
3    456      98

### total  sales

In [4]:
sales[["bread","butter"]].sum()

bread     1158
butter     233
dtype: int64

In [5]:
# select sum(bread) + sum(butter) from sales
sales[['bread','butter']].sum().sum()

1391

### total sales on weekday wise

In [10]:
sales.groupby("weekday")["bread"].sum()

weekday
mon    693
sun    465
Name: bread, dtype: int64

In [11]:
sales.groupby("weekday")["butter"].sum()

weekday
mon    143
sun     90
Name: butter, dtype: int64

### groupby and sum on multiple columns

In [12]:
sales.groupby('weekday').sum()

         bread  butter
weekday
mon        693     143
sun        465      90

In [13]:
sales.groupby("weekday")[['bread','butter']].sum()

         bread  butter
weekday
mon        693     143
sun        465      90

In [14]:
sales.groupby(["weekday","city"])[['bread','butter']].sum()

                bread  butter
weekday city
mon     dallas    693     143
sun     austin    465      90

### groupby and mean: multi level index

In [15]:
sales.groupby(['city','weekday']).mean()

                bread  butter
city   weekday
austin sun      232.5    45.0
dallas mon      346.5    71.5

### groupby and max on multiple columns

In [16]:
sales.groupby('city')[['bread','butter']].max()

        bread  butter
city
austin    326      70
dallas    456      98

### multiple agggregations

In [17]:
sales.groupby("weekday")[["bread","butter"]].agg(["min","max","sum","mean"])

        bread                  butter
          min  max  sum   mean    min max  sum  mean
weekday
mon       237  456  693  346.5     45  98  143  71.5
sun       139  326  465  232.5     20  70   90  45.0

### custom aggregation

In [18]:
def data_range(arg):
    return arg.max() - arg.min()

In [19]:
import numpy as np
data_range(np.array([10,20,30,40,50]))

40

In [20]:
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
mon        219      53
sun        187      50